app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY id DESC
---
  def index
    @orders = Order.order("id DESC")

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def ship
    @order = Order.find(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def shipped
    @order = Order.find(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def cancel
    @order = Order.find(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def return
    @order = Order.find(params[:id])