app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Pen"], ["description", "Nice Pen"], ["quantity", 100], ["price", 20], ["created_at", 2017-07-11 13:10:51 UTC], ["updated_at", 2017-07-11 13:10:51 UTC]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "cup-glass-03.jpg"], ["updated_at", 2017-07-11 13:40:18 UTC], ["id", 1]]
---
  def update
   @product = Product.find(params[:id])

    if @product.update(product_params)