app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "1"], ["LIMIT", 1]]
---
  def show
    @order = Order.find_by_token(params[:id])

INSERT INTO "orders" ("total", "user_id", "billing_name", "billing_address", "shipping_name", "shipping_address", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 5]]
SELECT "product_lists".* FROM "product_lists" WHERE "product_lists"."order_id" = ?  [["order_id", 4]]
INSERT INTO "product_lists" ("order_id", "product_name", "product_price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["product_name", "Cup"], ["product_price", 300], ["quantity", 1], ["created_at", 2017-07-12 22:58:53 UTC], ["updated_at", 2017-07-12 22:58:53 UTC]]
---
  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.total = current_cart.total_price

    if @order.save
        current_cart.cart_items.each do |cart_item|
        product_list = ProductList.new
        product_list.order = @order
        product_list.product_name = cart_item.product.title
        product_list.product_price = cart_item.product.price
        product_list.quantity = cart_item.quantity
        product_list.save

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "1b93dbcc-49ff-4040-891a-dce792450c00"], ["LIMIT", 1]]
---
  def pay_with_alipay
      @order = Order.find_by_token(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "f52a3843-84af-4333-829d-f6baf9d213b3"], ["LIMIT", 1]]
---
    def pay_with_wechat
      @order = Order.find_by_token(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def apply_to_cancel
      @order = Order.find(params[:id])