app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products"

  def show
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def add_to_cart
     @product = Product.find(params[:id])
     if !current_cart.products.include?(@product)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "products" INNER JOIN "cart_items" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = ? AND "products"."id" = ? LIMIT ?  [["cart_id", 4], ["id", 1], ["LIMIT", 1]]