app/views/common/_navbar.html.erb

SELECT COUNT(*) FROM "products" INNER JOIN "cart_items" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = ?  [["cart_id", 4]]
---
                <%= link_to carts_path do  %>
                     购物车 <i class="fa fa-shopping-cart"> </i> ( <%= current_cart.products.count %> )